Repository: bpython/bpython
Catalog: bpython/translations/*/LC_MESSAGES/bpython.po
Languages: de

source: {} version {} on top of Python {} {}
de: {} Version {} mit Python {} {}

source: {} See AUTHORS.rst for details.
de: {} Siehe AUTHORS.rst für mehr Details.

source: Usage: %(prog)s [options] [file [args]] NOTE: If bpython sees an argument it does not know, execution falls back to the regular Python interpreter.
de: Verwendung: %(prog)s [Optionen] [Datei [Argumente]] Hinweis: Wenn bpython Argumente übergeben bekommt, die nicht verstanden werden, wird der normale Python Interpreter ausgeführt.

source: Use CONFIG instead of default config file.
de: Verwende CONFIG antatt der standardmäßigen Konfigurationsdatei.

source: Drop to bpython shell after running file instead of exiting.
de: Verbleibe in bpython nach dem Ausführen der Datei.

source: Don't flush the output to stdout.
de: Gib Ausgabe beim Beenden nicht ernaut auf stdout aus.

source: Print version and exit.
de: Zeige Versionsinformationen an und beende.

source: Set log level for logging
de: Log-Stufe

source: Log output file
de: Datei für Ausgabe von Log-Nachrichten

source: File to execute and additional arguments passed on to the executed script.
de: Auszuführende Datei und zusätzliche Argumente, die an das Script übergeben werden sollen.

source: y
de: j

source: yes
de: ja

source: Rewind
de: Rückgängig

source: Save
de: Speichern

source: Show Source
de: Quellcode anzeigen

source: WARNING: You are using `bpython-cli`, the curses backend for `bpython`. This backend has been deprecated in version 0.19 and might disappear in a future version.
de: ACHTUNG: `bpython-cli` wird verwendet, die curses Implementierung von `bpython`. Diese Implementierung wird ab Version 0.19 nicht mehr aktiv unterstützt und wird in einer zukünftigen Version entfernt werden.

source: curtsies arguments
de: Argumente für curtsies

source: Additional arguments specific to the curtsies-based REPL.
de: Zusätzliche Argumente spezifisch für die curtsies-basierte REPL.

source: Error occurred while writing to file %s (%s)
de: Fehler beim Schreiben in Datei %s aufgetreten (%s)

source: Helper program not found.
de: Hilfsprogramm konnte nicht gefunden werden.

source: Helper program could not be run.
de: Hilfsprogramm konnte nicht ausgeführt werden.

source: Helper program returned non-zero exit status %d.
de: Hilfsprogramm beendete mit Status %d.

source: No output from helper program.
de: Keine Ausgabe von Hilfsprogramm vorhanden.

source: Failed to recognize the helper program's output as an URL.
de: Konnte Ausgabe von Hilfsprogramm nicht verarbeiten.

source: Nothing to get source of
de: Nichts um Quellcode abzurufen

source: Cannot get source: %s
de: Kann Quellcode nicht finden: %s

source: Cannot access source of %r
de: Kann auf Quellcode nicht zugreifen: %r

source: No source code found for %s
de: Quellcode für %s nicht gefunden

source: Save to file (Esc to cancel):
de: In Datei speichern (Esc um abzubrechen):

source: Save cancelled.
de: Speichern abgebrochen.

source: %s already exists. Do you want to (c)ancel, (o)verwrite or (a)ppend?
de: %s existiert bereit. (C) abbrechen, (o) überschrieben oder (a) anhängen?

source: overwrite
de: überschreiben

source: append
de: anhängen

source: Error writing file '%s': %s
de: Fehler beim Schreiben in Datei '%s': %s

source: Saved to %s.
de: Nach %s gespeichert.

source: No clipboard available.
de: Zwischenablage ist nicht verfügbar.

source: Could not copy to clipboard.
de: Konnte nicht in Zwischenablage kopieren.

source: Copied content to clipboard.
de: Inhalt wurde in Zwischenablage kopiert.

source: Pastebin buffer? (y/N)
de: Buffer bei Pastebin hochladen? (j/N)

source: Pastebin aborted.
de: Hochladen zu Pastebin abgebrochen.

source: Duplicate pastebin. Previous URL: %s. Removal URL: %s
de: Duplizierte Daten zu Pastebin hochgeladen. Vorherige URL: %s. URL zum Löschen: %s

source: Posting data to pastebin...
de: Lade Daten hoch zu Pastebin...

source: Upload failed: %s
de: Hochladen ist fehlgeschlagen: %s

source: Pastebin URL: %s - Removal URL: %s
de: Pastebin URL: %s - URL zum Löschen: %s

source: Undo how many lines? (Undo will take up to ~%.1f seconds) [1]
de: Wie viele Zeilen rückgängig machen? (Rückgängigmachen wird bis zu ~%.1f Sekunden brauchen) [1]

source: Undo canceled
de: Rückgängigmachen abgebrochen

source: Undoing %d line... (est. %.1f seconds)
de: Mache %d Zeile rückgängig... (ungefähr %.1f Sekunden)

source: Config file does not exist - create new from default? (y/N)
de: Konfigurationsdatei existiert nicht. Soll eine neue Datei erstellt werden? (j/N)

source: bpython config file edited. Restart bpython for changes to take effect.
de: bpython Konfigurationsdatei bearbeitet. Starte bpython neu damit die Änderungen übernommen werden.

source: Error editing config file: %s
de: Fehler beim Bearbeiten der Konfigurationsdatei: %s

source: <%s> Rewind <%s> Save <%s> Pastebin <%s> Pager <%s> Show Source
de: <%s> Rückgängigmachen <%s> Speichern <%s> Pastebin <%s> Pager <%s> Quellcode anzeigen

source: Run twisted reactor.
de: Führe twisted reactor aus.

source: Select specific reactor (see --help-reactors). Implies --twisted.
de: Wähle reactor aus (siehe --help-reactors). Impliziert --twisted.

source: List available reactors for -r.
de: Liste verfügbare reactors für -r auf.

source: twistd plugin to run (use twistd for a list). Use "--" to pass further options to the plugin.
de: Auszuführendes twistd Plugin (starte twistd für eine Liste). Verwende "--" um Optionen an das Plugin zu übergeben.

source: WARNING: You are using `bpython-urwid`, the urwid backend for `bpython`. This backend has been deprecated in version 0.19 and might disappear in a future version.
de: ACHTUNG: `bpython-urwid` wird verwendet, die curses Implementierung von `bpython`. Diese Implementierung wird ab Version 0.19 nicht mehr aktiv unterstützt und wird in einer zukünftigen Version entfernt werden.

source: Welcome to bpython!
de: Willkommen by bpython!

source: Press <%s> for help.
de: Drücke <%s> für Hilfe.

source: Executing PYTHONSTARTUP failed: %s
de: Fehler beim Ausführen von PYTHONSTARTUP: %s

source: Reloaded at %s because %s modified.
de: Bei %s neugeladen, da %s modifiziert wurde.

source: Session not reevaluated because it was not edited
de: Die Sitzung wurde nicht neu ausgeführt, da sie nicht berabeitet wurde

source: Session not reevaluated because saved file was blank
de: Die Sitzung wurde nicht neu ausgeführt, da die gespeicherte Datei leer war

source: Session edited and reevaluated
de: Sitzung bearbeitet und neu ausgeführt

source: Reloaded at %s by user.
de: Bei %s vom Benutzer neu geladen.

source: Auto-reloading deactivated.
de: Automatisches Neuladen deaktiviert.

source: Auto-reloading active, watching for file changes...
de: Automatisches Neuladen ist aktiv; beobachte Dateiänderungen...

source: Auto-reloading not available because watchdog not installed.
de: Automatisches Neuladen ist nicht verfügbar da watchdog nicht installiert ist.
